## Introduction to pandas Data Structures
### Series

In [1]:
from pandas import Series, DataFrame

In [2]:
import pandas as pd

In [3]:
obj = Series([4, 7, -5, 3])

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [9]:
obj2['a']

-5

In [10]:
obj2['d'] = 6

In [11]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [12]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [14]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
import numpy as np

In [16]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Another way to think about Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values. It can be substituted into many functions that expect a dict

In [17]:
'b' in obj2

True

In [18]:
'e' in obj2

False

In [19]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [20]:
obj3 = Series(sdata)

In [21]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [22]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [23]:
obj4 = Series(sdata, index=states)

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [27]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [29]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [30]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [31]:
obj4.name = 'population'

In [32]:
obj4.index.name = 'state'

In [33]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [34]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [35]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [36]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [37]:
frame = DataFrame(data)

In [38]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [39]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [40]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])

In [41]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [42]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [43]:
frame2.index

Index([u'one', u'two', u'three', u'four', u'five'], dtype='object')

In [44]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [45]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [46]:
type(frame2.year)

pandas.core.series.Series

In [47]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [48]:
frame2['debt'] = 16.5

In [49]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [50]:
frame2['debt'] = np.arange(5.)

In [51]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [52]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [53]:
frame2['debt'] = val

In [54]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [55]:
frame2.state == 'Ohio'

one       True
two       True
three     True
four     False
five     False
Name: state, dtype: bool

In [56]:
type(frame2.state == 'Ohio')

pandas.core.series.Series

In [57]:
frame2['eastern'] = frame2.state == 'Ohio'

In [58]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [59]:
del frame2['eastern']

In [60]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [61]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [62]:
frame3 = DataFrame(pop)

In [63]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [64]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [65]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

In [66]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [67]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [68]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [69]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [70]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Index Objects

In [71]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [72]:
index = obj.index

In [73]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [74]:
index[1:]

Index([u'b', u'c'], dtype='object')

Index objects are immutable and thus canâ€™t be modified by the user

In [75]:
# index[1] = 'd'

In [76]:
index = pd.Index(np.arange(3))

In [77]:
obj2 = Series([1.5, -2.5, 0], index=index)

In [78]:
obj2.index is index

True

In [79]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [80]:
'Ohio' in frame3.columns

True

In [81]:
2003 in frame3.index

False

## Essential Functionality
### Reindexing

In [82]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [83]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [84]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [85]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [86]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [87]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [88]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [89]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])

In [90]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [91]:
frame2 = frame.reindex(list('abcd'))

In [92]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [93]:
states = ['Texas', 'Utah', 'California']

In [94]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [95]:
frame.reindex(index=list('abcd'), method='ffill', columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [96]:
frame.ix[list('abcd'), states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping entries from an axis

In [97]:
obj = Series(np.arange(5.), index=list('abcde'))

In [98]:
new_obj = obj.drop('c')

In [99]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [100]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [101]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [102]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [103]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [104]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [105]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [106]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

In [107]:
obj = Series(np.arange(4.), index=list('abcd'))

In [108]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [109]:
obj['b']

1.0

In [110]:
obj[1]

1.0

In [111]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [112]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [113]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [114]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [115]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [116]:
obj['b':'c'] = 5

In [117]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [118]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [119]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [120]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [121]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [122]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [123]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [124]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [125]:
data[data < 5] = 0

In [126]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [127]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [128]:
type(data.ix['Colorado', ['two', 'three']])

pandas.core.series.Series

In [129]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [130]:
type(data.ix[['Colorado', 'Utah'], [3, 0, 1]])

pandas.core.frame.DataFrame

In [131]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [132]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [133]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment

In [134]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=list('acde'))

In [135]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=list('acefg'))

In [136]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [137]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [138]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [139]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])

In [140]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [141]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [142]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [143]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [144]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

In [145]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [146]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [147]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [148]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [149]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [150]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [151]:
arr = np.arange(12.).reshape((3, 4))

In [152]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [153]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [154]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [155]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [156]:
series = frame.ix[0]

In [157]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [158]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [159]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [160]:
series2 = Series(range(3), index=list('bef'))

In [161]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [162]:
series2

b    0
e    1
f    2
dtype: int64

In [163]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [164]:
series3 = frame['d']

In [165]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [166]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [167]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping

In [168]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [169]:
frame

               b         d         e
Utah   -0.871338  0.554041  0.611686
Ohio    2.028346 -0.401848  0.639657
Texas   0.634770  0.011289 -1.363727
Oregon -0.730257  0.197457  0.417702

In [170]:
np.abs(frame)

               b         d         e
Utah    0.871338  0.554041  0.611686
Ohio    2.028346  0.401848  0.639657
Texas   0.634770  0.011289  1.363727
Oregon  0.730257  0.197457  0.417702

In [171]:
f = lambda x: x.max() - x.min()

In [172]:
frame.apply(f)

b    2.899684
d    0.955890
e    2.003383
dtype: float64

In [173]:
frame.apply(f, axis=1)

Utah      1.483024
Ohio      2.430194
Texas     1.998497
Oregon    1.147959
dtype: float64

In [174]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [175]:
frame.apply(f)

            b         d         e
min -0.871338 -0.401848 -1.363727
max  2.028346  0.554041  0.639657

In [176]:
frame

               b         d         e
Utah   -0.871338  0.554041  0.611686
Ohio    2.028346 -0.401848  0.639657
Texas   0.634770  0.011289 -1.363727
Oregon -0.730257  0.197457  0.417702

In [177]:
format = lambda x: '%.2f' % x

In [178]:
frame.applymap(format)

            b      d      e
Utah    -0.87   0.55   0.61
Ohio     2.03  -0.40   0.64
Texas    0.63   0.01  -1.36
Oregon  -0.73   0.20   0.42

In [179]:
frame['e'].map(format)

Utah       0.61
Ohio       0.64
Texas     -1.36
Oregon     0.42
Name: e, dtype: object

### Sorting and ranking

In [180]:
obj = Series(range(4), index=list('dabc'))

In [181]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [182]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [183]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=list('dabc'))

In [184]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [185]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [186]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [187]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [188]:
obj = Series([4, 7, -3, 2])

In [189]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [190]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [191]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [192]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

On DataFrame, you may want to sort by the values in one or more columns. To do so, pass one or more column names to the by option:

In [193]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [194]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [195]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [196]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

Ranking is closely related to sorting, assigning ranks from one through the number of
valid data points in an array. It is similar to the indirect sort indices produced by
numpy.argsort , except that ties are broken according to a rule. The rank methods for
Series and DataFrame are the place to look; by default rank breaks ties by assigning
each group the mean rank:

In [197]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [198]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [199]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [200]:
obj.rank(method='max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [201]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [202]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})

In [203]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [204]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### Axis indexes with duplicate values

In [205]:
obj = Series(range(5), index=list('aabbc'))

In [206]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [207]:
obj.index.is_unique

False

In [208]:
obj['a']

a    0
a    1
dtype: int64

In [209]:
type(obj['a'])

pandas.core.series.Series

In [210]:
obj['c']

4

In [211]:
type(obj['c'])

numpy.int64

In [212]:
df = DataFrame(np.random.randn(4, 3), index=list('aabb'))

In [213]:
df

          0         1         2
a -0.835937  0.731737  0.062291
a -0.742870  0.129263 -1.170893
b  0.821919 -0.703620 -0.019151
b -0.432528 -0.997665 -1.073012

In [214]:
df.ix['b']

          0         1         2
b  0.821919 -0.703620 -0.019151
b -0.432528 -0.997665 -1.073012

In [215]:
type(df.ix['b'])

pandas.core.frame.DataFrame

## Summarizing and Computing Descriptive Statistics

In [216]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=list('abcd'),
               columns=['one', 'two'])

In [217]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [218]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [219]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [220]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [221]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [222]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [223]:
df.idxmax()

one    b
two    d
dtype: object

In [224]:
df.idxmin()

one    d
two    b
dtype: object

In [225]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [226]:
df.describe()

/home/jichao/.local/lib/python2.7/site-packages/numpy/lib/function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%         NaN       NaN
50%         NaN       NaN
75%         NaN       NaN
max    7.100000 -1.300000

In [227]:
obj = Series(list('aabc') * 4)

In [228]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [229]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

In [230]:
from pandas import DataFrame, Series

In [231]:
import pandas as pd

In [232]:
import numpy as np

In [233]:
from pandas_datareader import data as web, wb

In [234]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')

In [235]:
price = DataFrame({tic: data['Adj Close']
                    for tic, data in all_data.iteritems()})

In [236]:
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.iteritems()})

In [237]:
returns = price.pct_change()

In [238]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2009-12-24  0.034339  0.011117  0.004385  0.002587
2009-12-28  0.012294  0.007098  0.013326  0.005484
2009-12-29 -0.011861 -0.005571 -0.003477  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013699
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504

In [239]:
returns.MSFT.corr(returns.IBM)

0.49597967972033752

In [240]:
returns.MSFT.cov(returns.IBM)

0.00021595764064430051

In [241]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.470676  0.410011  0.424305
GOOG  0.470676  1.000000  0.390689  0.443587
IBM   0.410011  0.390689  1.000000  0.495980
MSFT  0.424305  0.443587  0.495980  1.000000

In [242]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.001027  0.000303  0.000252  0.000309
GOOG  0.000303  0.000580  0.000142  0.000205
IBM   0.000252  0.000142  0.000367  0.000216
MSFT  0.000309  0.000205  0.000216  0.000516

In [243]:
returns.corrwith(returns.IBM)

AAPL    0.410011
GOOG    0.390689
IBM     1.000000
MSFT    0.495980
dtype: float64

In [244]:
returns.corrwith(volume)

AAPL   -0.057549
GOOG    0.062647
IBM    -0.007892
MSFT   -0.014245
dtype: float64

### Unique Values, Value Counts, and Membership

In [245]:
obj = Series(list('cadaabbcc'))

In [246]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [247]:
uniques = obj.unique()

In [248]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [249]:
uniques.sort()

In [250]:
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [251]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [252]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [253]:
from collections import Counter

In [254]:
Counter(obj.values)

Counter({'a': 3, 'b': 2, 'c': 3, 'd': 1})

In [255]:
mask = obj.isin(['b', 'c'])

In [256]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [257]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [258]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})

In [259]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [260]:
result = data.apply(pd.value_counts).fillna(0)

In [261]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling Missing Data

In [262]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [263]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [264]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [265]:
string_data[0] = None

In [266]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [267]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [268]:
from numpy import nan as NA

In [269]:
data = Series([1, NA, 3.5, NA, 7])

In [270]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [271]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [272]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])

In [273]:
cleaned = data.dropna()

In [274]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [275]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [276]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [277]:
data[4] = NA

In [278]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [279]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [280]:
df = DataFrame(np.random.randn(7, 3))

In [281]:
df

          0         1         2
0 -0.649516  1.610049  0.846591
1  0.924407  0.151983 -0.677852
2  0.058333 -2.320415 -0.313558
3  0.788065 -1.318135  2.016924
4 -0.232747  0.121270 -1.097094
5 -0.031663  0.563717  0.506767
6 -1.772230  0.740773 -1.261320

In [282]:
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA

In [283]:
df

          0         1         2
0 -0.649516       NaN       NaN
1  0.924407       NaN       NaN
2  0.058333       NaN       NaN
3  0.788065       NaN  2.016924
4 -0.232747       NaN -1.097094
5 -0.031663  0.563717  0.506767
6 -1.772230  0.740773 -1.261320

In [284]:
df.dropna(thresh=3)

          0         1         2
5 -0.031663  0.563717  0.506767
6 -1.772230  0.740773 -1.261320

### Filling in Missing Data

In [285]:
df

          0         1         2
0 -0.649516       NaN       NaN
1  0.924407       NaN       NaN
2  0.058333       NaN       NaN
3  0.788065       NaN  2.016924
4 -0.232747       NaN -1.097094
5 -0.031663  0.563717  0.506767
6 -1.772230  0.740773 -1.261320

In [286]:
df.fillna(0)

          0         1         2
0 -0.649516  0.000000  0.000000
1  0.924407  0.000000  0.000000
2  0.058333  0.000000  0.000000
3  0.788065  0.000000  2.016924
4 -0.232747  0.000000 -1.097094
5 -0.031663  0.563717  0.506767
6 -1.772230  0.740773 -1.261320

In [287]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.649516  0.500000       NaN
1  0.924407  0.500000       NaN
2  0.058333  0.500000       NaN
3  0.788065  0.500000  2.016924
4 -0.232747  0.500000 -1.097094
5 -0.031663  0.563717  0.506767
6 -1.772230  0.740773 -1.261320

In [288]:
df.fillna(0, inplace=True)

In [289]:
df

          0         1         2
0 -0.649516  0.000000  0.000000
1  0.924407  0.000000  0.000000
2  0.058333  0.000000  0.000000
3  0.788065  0.000000  2.016924
4 -0.232747  0.000000 -1.097094
5 -0.031663  0.563717  0.506767
6 -1.772230  0.740773 -1.261320

In [290]:
df = DataFrame(np.random.randn(6, 3))

In [291]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA

In [292]:
df

          0         1         2
0 -0.796152 -0.016166 -0.083442
1  1.336691  1.080451 -1.837201
2  1.342447       NaN  1.444197
3 -1.572044       NaN -0.262216
4 -0.092797       NaN       NaN
5 -1.760549       NaN       NaN

In [293]:
df

          0         1         2
0 -0.796152 -0.016166 -0.083442
1  1.336691  1.080451 -1.837201
2  1.342447       NaN  1.444197
3 -1.572044       NaN -0.262216
4 -0.092797       NaN       NaN
5 -1.760549       NaN       NaN

In [294]:
df.fillna(method='ffill')

          0         1         2
0 -0.796152 -0.016166 -0.083442
1  1.336691  1.080451 -1.837201
2  1.342447  1.080451  1.444197
3 -1.572044  1.080451 -0.262216
4 -0.092797  1.080451 -0.262216
5 -1.760549  1.080451 -0.262216

In [295]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.796152 -0.016166 -0.083442
1  1.336691  1.080451 -1.837201
2  1.342447  1.080451  1.444197
3 -1.572044  1.080451 -0.262216
4 -0.092797       NaN -0.262216
5 -1.760549       NaN -0.262216

In [296]:
data = Series([1., NA, 3.5, NA, 7])

In [297]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical Indexing

In [298]:
data = Series(np.random.randn(10),
              index = [list('aaabbbccdd'),
              [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [299]:
data

a  1   -0.348767
   2    0.185778
   3   -0.160047
b  1    0.908635
   2   -0.195566
   3    1.410486
c  1   -0.480473
   2   -1.369707
d  2   -0.445589
   3    0.413353
dtype: float64

In [300]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [301]:
data['b']

1    0.908635
2   -0.195566
3    1.410486
dtype: float64

In [302]:
data['b':'c']

b  1    0.908635
   2   -0.195566
   3    1.410486
c  1   -0.480473
   2   -1.369707
dtype: float64

In [303]:
data.ix[['b', 'd']]

b  1    0.908635
   2   -0.195566
   3    1.410486
d  2   -0.445589
   3    0.413353
dtype: float64

In [304]:
data[:, 2]

a    0.185778
b   -0.195566
c   -1.369707
d   -0.445589
dtype: float64

In [305]:
data.unstack()

          1         2         3
a -0.348767  0.185778 -0.160047
b  0.908635 -0.195566  1.410486
c -0.480473 -1.369707       NaN
d       NaN -0.445589  0.413353

In [306]:
data

a  1   -0.348767
   2    0.185778
   3   -0.160047
b  1    0.908635
   2   -0.195566
   3    1.410486
c  1   -0.480473
   2   -1.369707
d  2   -0.445589
   3    0.413353
dtype: float64

In [307]:
data.unstack().stack()

a  1   -0.348767
   2    0.185778
   3   -0.160047
b  1    0.908635
   2   -0.195566
   3    1.410486
c  1   -0.480473
   2   -1.369707
d  2   -0.445589
   3    0.413353
dtype: float64

In [308]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[list('aabb'), [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])

In [309]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [310]:
frame.index.names = ['key1', 'key2']

In [311]:
frame.columns.names = ['state', 'color']

In [312]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [313]:
frame['Ohio'].index

MultiIndex(levels=[[u'a', u'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=[u'key1', u'key2'])

In [314]:
frame['Ohio'].columns

Index([u'Green', u'Red'], dtype='object', name=u'color')

In [315]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [316]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], 
                           ['Green', 'Red', 'Green']],
                          names=['state', 'color'])

MultiIndex(levels=[[u'Colorado', u'Ohio'], [u'Green', u'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=[u'state', u'color'])

### Reordering and Sorting Levels

In [317]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [318]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [319]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [320]:
frame.swaplevel(0, 1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [321]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary Statistics by Level

In [322]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [323]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [324]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's Columns

In [325]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})

In [326]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [327]:
frame2 = frame.set_index(['c', 'd'])

In [328]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [329]:
frame2.index

MultiIndex(levels=[[u'one', u'two'], [0, 1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 1], [0, 1, 2, 0, 1, 2, 3]],
           names=[u'c', u'd'])

In [330]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [331]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [332]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [333]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas Topics

### Integer Indexing

In [334]:
ser = Series(np.arange(3.))

In [335]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [336]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])

In [337]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [338]:
ser2[-1]

2.0

In [339]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [340]:
ser3 = Series(range(3), index=[-5, 1, 3])

In [341]:
ser3.iloc[2]

2

In [342]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])

In [343]:
frame

   0  1
2  0  1
0  2  3
1  4  5

In [344]:
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int64

### Panel Data

In [345]:
from pandas_datareader import data as web, wb

In [346]:
pdata = pd.Panel(dict(
        (stk, web.get_data_yahoo(stk, '1/1/2009', '6/1/2012'))
        for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [347]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 868 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: Open to Adj Close

In [348]:
pdata = pdata.swapaxes('items', 'minor')

In [349]:
pdata['Adj Close']

                 AAPL      DELL        GOOG       MSFT
Date
2009-01-02  11.869133  10.39902  160.499779  16.612779
2009-01-05  12.370056  10.26359  163.861421  16.768039
2009-01-06  12.166024  10.68922  166.863420  16.964157
2009-01-07  11.903138  10.78596  160.844427  15.942712
2009-01-08  12.124172  10.90204  162.432840  16.441177
2009-01-09  11.846898  10.75694  157.377899  15.950883
2009-01-12  11.595783  10.30228  156.189080  15.910025
2009-01-13  11.471533  10.40869  157.003261  16.196030
2009-01-14  11.160254   9.97338  150.334921  15.599506
2009-01-15  10.905215  10.19587  149.345914  15.722079
2009-01-16  10.767887   9.93469  149.685575  16.106142
2009-01-20  10.227726   9.52840  141.234014  15.101041
2009-01-21  10.833281   9.86697  151.388865  15.836481
2009-01-22  11.556546   9.65416  153.097158  13.981538
2009-01-23  11.556546   9.80893  162.188089  14.055082
2009-01-26  11.723957   9.97338  161.773501  14.406458
2009-01-27  11.866517   9.74122  165.574702  14.430973
2009-01-28  12.320356  10.52477  174.161139  14.741493
2009-01-29  12.163408   9.62514  171.488809  14.373772
2009-01-30  11.788043   9.18983  169.096191  13.973366
2009-02-02  11.968532   9.00603  170.115172  14.569890
2009-02-03  12.160793   9.45101  170.055239  15.117384
2009-02-04  12.235342   9.47036  171.328962  15.223614
2009-02-05  12.615939   9.12212  176.683613  15.558649
2009-02-06  13.042313   9.15114  185.454867  16.065285
2009-02-09  13.407216   9.32526  189.196135  15.885511
2009-02-10  12.795121   8.86093  179.076231  15.362530
2009-02-11  12.663024   8.72550  178.841472  15.697564
2009-02-12  12.983458   8.87060  181.343964  15.738423
2009-02-13  12.969071   8.82224  178.661643  15.599506
...               ...       ...         ...        ...
2012-04-23  74.772262  15.57434  298.502008  28.335919
2012-04-24  73.278652  15.65173  300.335186  28.159482
2012-04-25  79.781500  15.88390  304.555978  28.406495
2012-04-26  79.480681  15.99030  307.428105  28.327098
2012-04-27  78.865975  15.90324  307.183354  28.212413
2012-04-30  76.378357  15.83553  302.123410  28.247701
2012-05-01  76.136400  15.86455  301.913607  28.238877
2012-05-02  76.639935  15.64689  303.327209  28.053618
2012-05-03  76.095852  15.70010  305.205309  28.018332
2012-05-04  73.928674  15.29381  298.187334  27.330223
2012-05-07  74.481914  15.30348  303.472045  27.039101
2012-05-08  74.311887  15.19708  306.089446  26.906773
2012-05-09  74.442679  15.15838  304.271262  27.136142
2012-05-10  74.617931  15.04230  306.524016  27.118498
2012-05-11  74.119627  14.91654  302.313200  27.489018
2012-05-14  73.009223  14.93589  301.698816  27.065567
2012-05-15  72.348738  14.83916  305.250263  26.825811
2012-05-16  71.421443  14.52477  314.151389  26.550539
2012-05-17  69.334046  14.45222  311.214326  26.390703
2012-05-18  69.368049  14.25875  299.900615  25.991113
2012-05-21  73.409437  14.48124  306.748784  26.417342
2012-05-22  72.845742  14.58765  300.100412  26.426222
2012-05-23  74.623162  12.08221  304.426106  25.849037
2012-05-24  73.937831  12.04351  301.528978  25.813517
2012-05-25  73.541536  12.05319  295.470050  25.804637
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  74.846812  12.24666  296.873645  26.248626
2012-05-30  75.749262  12.14992  293.821674  26.053272
2012-05-31  75.560928  11.92743  290.140354  25.920075
2012-06-01  73.371509  11.67592  285.205295  25.262972

[868 rows x 4 columns]

In [350]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close       Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900.0   73.371509
DELL   12.150000   12.300000   12.045000   12.070000   19397600.0   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700.0  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300.0   25.262972

In [351]:
pdata.ix['Adj Close', '5/22/2012':, :]

                 AAPL      DELL        GOOG       MSFT
Date
2012-05-22  72.845742  14.58765  300.100412  26.426222
2012-05-23  74.623162  12.08221  304.426106  25.849037
2012-05-24  73.937831  12.04351  301.528978  25.813517
2012-05-25  73.541536  12.05319  295.470050  25.804637
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  74.846812  12.24666  296.873645  26.248626
2012-05-30  75.749262  12.14992  293.821674  26.053272
2012-05-31  75.560928  11.92743  290.140354  25.920075
2012-06-01  73.371509  11.67592  285.205295  25.262972

In [352]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()

In [353]:
stacked

                        Open        High         Low       Close       Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400.0
           DELL    12.590000   12.700000   12.460000   12.560000   19787800.0
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600.0
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500.0
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600.0
           DELL    12.530000   12.540000   12.330000   12.330000   19955600.0
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800.0
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000.0
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900.0
           DELL    12.150000   12.300000   12.045000   12.070000   19397600.0
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700.0
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300.0

                   Adj Close
Date       minor
2012-05-30 AAPL    75.749262
           DELL    12.149920
           GOOG   293.821674
           MSFT    26.053272
2012-05-31 AAPL    75.560928
           DELL    11.927430
           GOOG   290.140354
           MSFT    25.920075
2012-06-01 AAPL    73.371509
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.262972

In [354]:
type(stacked)

pandas.core.frame.DataFrame

In [355]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 3 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT